/**
 ****************************************************************************************************
 * @file        led.h
 * @author      ����ԭ���Ŷ�(ALIENTEK)
 * @version     V1.0
 * @date        2023-08-01
 * @brief       LED ��������
 * @license     Copyright (c) 2020-2032, �������������ӿƼ����޹�˾
 ****************************************************************************************************
 * @attention
 *
 * ʵ��ƽ̨:����ԭ�� M48Z-M3��Сϵͳ��STM32F103��
 * ������Ƶ:www.yuanzige.com
 * ������̳:www.openedv.com
 * ��˾��ַ:www.alientek.com
 * �����ַ:openedv.taobao.com
 *
 ****************************************************************************************************
 */


#ifndef _LED_H
#define _LED_H
#include "./SYSTEM/sys/sys.h"


/******************************************************************************************/
/* LED 引脚定义 */

#define LED_GPIO_PORT                   GPIOB
#define LED_GPIO_CLK_ENABLE()           do{ __HAL_RCC_GPIOB_CLK_ENABLE(); }while(0)

/* LED 控制宏 */
#define LED(x, pin)                     do{ x ? \
                                            HAL_GPIO_WritePin(GPIOB, pin, GPIO_PIN_SET) : \
                                            HAL_GPIO_WritePin(GPIOB, pin, GPIO_PIN_RESET); \
                                        }while(0)

#define LED_TOGGLE(pin)                 do{ HAL_GPIO_TogglePin(GPIOB, pin); }while(0)

/******************************************************************************************/
/* �ⲿ�ӿں���*/
void led_init(void);                                                                            /* ��ʼ�� */

#endif
